Revit 2024 API
TemporaryViewModes.IsCustomized Method
 Identifies if a custom temporary view mode is currently active. A custom mode is active if there is a non-empty string set for CustomTitle.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public bool IsCustomized()
Visual Basic
Public Function IsCustomized As Boolean
Visual C++
public:
bool IsCustomized()
Return Value
 Returns true a custom temporary view mode is currently active, false otherwise. A custom mode is active if there is a non-empty string set for CustomTitle.
See Also
TemporaryViewModes Class
Autodesk.Revit.DB Namespace